#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/5ed8ef17-8fc9-4124-9514-82fd2ecd9868/terraform-bin show -no-color plan.tmp

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.project-factory["new-luis"].module.budget.data.google_project.project[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "new-luis-lhw3"
      + skip_delete         = (known after apply)
    }

  # module.project-factory["new-luis"].module.project-factory.google_project_default_service_accounts.default_service_accounts[0] will be created
  + resource "google_project_default_service_accounts" "default_service_accounts" {
      + action           = "DEPRIVILEGE"
      + id               = (known after apply)
      + project          = "new-luis-lhw3"
      + restore_policy   = "REVERT_AND_IGNORE_FAILURE"
      + service_accounts = (known after apply)
    }

  # module.project-factory["new-luis"].module.project-factory.google_service_account.default_service_account[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "google_service_account" "default_service_account" {
      - account_id   = "project-service-account" -> null
      - disabled     = false -> null
      - display_name = "new-luis Project Service Account" -> null
      - email        = "project-service-account@new-luis-lhw3.iam.gserviceaccount.com" -> null
      - id           = "projects/new-luis-lhw3/serviceAccounts/project-service-account@new-luis-lhw3.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:project-service-account@new-luis-lhw3.iam.gserviceaccount.com" -> null
      - name         = "projects/new-luis-lhw3/serviceAccounts/project-service-account@new-luis-lhw3.iam.gserviceaccount.com" -> null
      - project      = "new-luis-lhw3" -> null
      - unique_id    = "112660460951432354476" -> null
    }

  # module.project-factory["new-luis"].module.project-factory.module.project_services.google_project_service.project_services["oslogin.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "new-luis-lhw3"
      + service                    = "oslogin.googleapis.com"
    }

Plan: 2 to add, 0 to change, 1 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  - destroy%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.project-factory["new-luis"].module.budget.data.google_project.project[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "google_project" "project" {%0A      + auto_create_network = (known after apply)%0A      + billing_account     = (known after apply)%0A      + folder_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + labels              = (known after apply)%0A      + name                = (known after apply)%0A      + number              = (known after apply)%0A      + org_id              = (known after apply)%0A      + project_id          = "new-luis-lhw3"%0A      + skip_delete         = (known after apply)%0A    }%0A%0A  # module.project-factory["new-luis"].module.project-factory.google_project_default_service_accounts.default_service_accounts[0] will be created%0A  + resource "google_project_default_service_accounts" "default_service_accounts" {%0A      + action           = "DEPRIVILEGE"%0A      + id               = (known after apply)%0A      + project          = "new-luis-lhw3"%0A      + restore_policy   = "REVERT_AND_IGNORE_FAILURE"%0A      + service_accounts = (known after apply)%0A    }%0A%0A  # module.project-factory["new-luis"].module.project-factory.google_service_account.default_service_account[0] will be destroyed%0A  # (because index [0] is out of range for count)%0A  - resource "google_service_account" "default_service_account" {%0A      - account_id   = "project-service-account" -> null%0A      - disabled     = false -> null%0A      - display_name = "new-luis Project Service Account" -> null%0A      - email        = "project-service-account@new-luis-lhw3.iam.gserviceaccount.com" -> null%0A      - id           = "projects/new-luis-lhw3/serviceAccounts/project-service-account@new-luis-lhw3.iam.gserviceaccount.com" -> null%0A      - member       = "serviceAccount:project-service-account@new-luis-lhw3.iam.gserviceaccount.com" -> null%0A      - name         = "projects/new-luis-lhw3/serviceAccounts/project-service-account@new-luis-lhw3.iam.gserviceaccount.com" -> null%0A      - project      = "new-luis-lhw3" -> null%0A      - unique_id    = "112660460951432354476" -> null%0A    }%0A%0A  # module.project-factory["new-luis"].module.project-factory.module.project_services.google_project_service.project_services["oslogin.googleapis.com"] will be created%0A  + resource "google_project_service" "project_services" {%0A      + disable_dependent_services = true%0A      + disable_on_destroy         = true%0A      + id                         = (known after apply)%0A      + project                    = "new-luis-lhw3"%0A      + service                    = "oslogin.googleapis.com"%0A    }%0A%0APlan: 2 to add, 0 to change, 1 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>


*Pusher: @luismendezescobar, Action: `pull_request`, Working Directory: `/home/runner/work/project-factory/project-factory`, Workflow: `validate code`*